       01 BOOKPARAMETERS.
           03 FACTOR PIC 9(6) VALUE ZEROS.
           03 FATOR-ESCRITA PIC ZZZ9 VALUE ZEROS.
           03 DIVISOR PIC 9(6) VALUE ZEROS.
